<?php

return [
    'root' => 'Корень',

    /*
        |--------------------------------------------------------------------------
        | Buttons
        |--------------------------------------------------------------------------
    */
    'button.save' => 'Сохранить',
    'button.expand_all' => 'Раскрыть все',
    'button.collapse_all' => 'Свернуть все',

    /*
        |--------------------------------------------------------------------------
        | Form
        |--------------------------------------------------------------------------
    */
    'components.tree.buttons.select_all.label' => 'Выбрать все',
    'components.tree.buttons.deselect_all.label' => 'Снять все',
    'components.tree.buttons.expand_all.label' => 'Раскрыть все',
    'components.tree.buttons.collapse_all.label' => 'Свернуть все',

    /*
        |--------------------------------------------------------------------------
        | Message
        |--------------------------------------------------------------------------
    */
    'actions.delete.confirmation.with_children' => 'Вы уверены, что хотите удалить все элементы и их потомков?',
];
